# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
data = [4,8,15,16,23,43]
s = pd.Series(data)

In [3]:
s

0     4
1     8
2    15
3    16
4    23
5    43
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [4]:
nums = [1,2,3,4,5,6,7,8,9,10]

pd.Series(nums)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:
# Then, print the DataFrame

In [22]:
data = [['alice',25,'female'],
        ['Bob',30,'male'],
        ['Claire',27,'female']]

In [23]:
df = pd.DataFrame(data,columns=['name','age','gender'])

In [24]:
df

     name  age  gender
0   alice   25  female
1     Bob   30    male
2  Claire   27  female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is a data structure that organizes data into a 2-dimensional table of rows and columns, much like a spreadsheet. 

The Pandas Series can be defined as a one-dimensional array that is capable of storing various data types. Series is a type of list in pandas.

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

there are many functions like :

In [25]:
df.head(2)

    name  age  gender
0  alice   25  female
1    Bob   30    male

In [26]:
df.tail(2)

     name  age  gender
1     Bob   30    male
2  Claire   27  female

In [27]:
list(df.columns)

['name', 'age', 'gender']

In [28]:
df['name']

0     alice
1       Bob
2    Claire
Name: name, dtype: object

In [29]:
df['age']

0    25
1    30
2    27
Name: age, dtype: int64

In [31]:
df.dtypes

name      object
age        int64
gender    object
dtype: object

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

    Series
    DataFrame

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [34]:
s1 = pd.Series(['akshay','jay','hiren'])
s2 = pd.Series([21,22,21])
s3 = pd.Series(['Ahmedabad','Ahmedabad','Ahmedabad'])

df = pd.DataFrame({'Name':s1, 'Age':s2, 'City':s3})

In [35]:
df

     Name  Age       City
0  akshay   21  Ahmedabad
1     jay   22  Ahmedabad
2   hiren   21  Ahmedabad